COLORS_RGB = [
    [1, 0, 0],  # 红
    [1, 0.5, 0],  # 橙
    [1, 1, 0],  # 黄
    [0, 0.5, 0],  # 绿
    [0, 0, 1],  # 蓝
    [0.3, 0, 0.5],  # 靛
    [0.9, 0.5, 0.9],  # 紫
    [1, 0.4, 0.4],  # 浅红
    [1, 0.55, 0],  # 深橙
    [1, 0.87, 0],  # 金黄
    [0.2, 0.8, 0.2],  # 青柠绿
    [0, 0.5, 0.5],  # 蓝绿
    [0, 0, 0.5],  # 海军蓝
    [0.2, 0, 0.2],  # 深靛
    [1, 0, 1],  # 品红
    [1, 0.5, 0.3],  # 珊瑚红
    [1, 0.97, 0],  # 柠檬黄
    [0.25, 0.88, 0.8],  # 绿松石
    [0.53, 0.8, 0.92],  # 天蓝
    [0.9, 0.9, 0.98]  # 薰衣草
]

COLORS_NAME = [
    '(red)',
    '(orange)',
    '(yellow)',
    '(green)',
    '(blue)',
    '(indigo)',
    '(violet)',
    '(light red)',
    '(dark orange)',
    '(golden yellow)',
    '(lime green)',
    '(teal)',
    '(navy blue)',
    '(deep indigo)',
    '(magenta)',
    '(coral)',
    '(lemon yellow)',
    '(turquoise)',
    '(sky blue)',
    '(lavender)'
]
